In [46]:
import pandas as pd
# link to the data https://data.humdata.org/dataset/novel-coronavirus-2019-ncov-cases

In [17]:
df = pd.read_csv('time_series_covid19_confirmed_global.csv')
df = df.drop(['Province/State','Lat','Long'],axis=1)
df['Country/Region'] = df['Country/Region'].apply(lambda x:str(x).lower())
df = df[df['Country/Region'].apply(lambda x : x in ['uganda','kenya','tanzania'])].T

In [29]:
columns = list(df[df[158]=='kenya'].values[0])

In [32]:
df = df[df[158]!='kenya']
df.columns = columns

In [34]:
## When did uganda surpass 100k cases?

In [40]:
df[df['uganda']>=100000]

          kenya tanzania  uganda
8/23/21  229628     1367  118777
8/24/21  230794     1367  118900
8/25/21  232052     1367  119037
8/26/21  232869     1367  119141
8/27/21  233801     1367  119327
8/28/21  234589     1367  119544
8/29/21  234952     1367  119732

In [41]:
## when did uganda surpass 50k

In [42]:
df[df['uganda']>=50000]

          kenya tanzania  uganda
6/4/21   171942      509   51006
6/5/21   172325      509   51676
6/6/21   172491      509   52935
6/7/21   172639      509   53961
6/8/21   173072      509   54669
...         ...      ...     ...
8/25/21  232052     1367  119037
8/26/21  232869     1367  119141
8/27/21  233801     1367  119327
8/28/21  234589     1367  119544
8/29/21  234952     1367  119732

[87 rows x 3 columns]

In [43]:
## what are the days when kenya was above 100k cases and uganda was below 50 cases?

In [51]:
df[(df['uganda']<=50000)&(df['kenya']>100000)]

          kenya tanzania uganda
1/25/21  100052      509  39188
1/26/21  100193      509  39261
1/27/21  100323      509  39314
1/28/21  100422      509  39424
1/29/21  100563      509  39490
...         ...      ...    ...
5/30/21  170647      509  46623
5/31/21  170735      509  47147
6/1/21   171084      509  47761
6/2/21   171226      509  48676
6/3/21   171658      509  49759

[130 rows x 3 columns]

In [45]:
## what are the day when kenya was above 100k cases and uganda was between 50k and 100k cases?

In [57]:
days = list(df[(df['uganda']>=50000)&(df['kenya']>100000)&(df['uganda']<=100000)].index)
print(f'Days from {days[0]} to {days[-1]}')

Days from 6/4/21 to 8/22/21